* Request <2018-04-05 Thu> from gigio.
  :LOGBOOK:
  CLOCK: [2018-04-06 Fri 15:00]--[2018-04-06 Fri 16:15] =>  1:15
  CLOCK: [2018-04-05 Thu 15:00]--[2018-04-05 Thu 17:10] =>  2:10
  :END:

He'd like to try and tell which isoform of a few genes was being used in the C1 mouse limb data.

ENSMUSG00000020167
ENSMUSG00000032228
ENSMUSG00000063659
ENSMUSG00000030189

['ENSMUSG00000020167','ENSMUSG00000032228','ENSMUSG00000063659','ENSMUSG00000030189']

Wrote [[file:generate_combined_transcript_C1.py]] to generate his output file

* Request <2018-05-07 Mon> from Brian compare what's been submitted to what should be submitted.
[[file:compare_lists_submitted_cells_vs_cells_in_paper_May4_2018.ods][compare_lists_submitted_cells_vs_cells_in_paper_May4_2018.ods]] sheet should_be_submitted

Message-ID: <DM6PR03MB3515995D17F635F25D20E31FA0850@DM6PR03MB3515.namprd03.prod.outlook.com>

#+BEGIN_SRC python :results output
  import sys
  import pandas
  from pandasodf import ODFReader
  from htsworkflow.submission.encoded import ENCODED
  from requests.exceptions import  HTTPError

  def main():
      book = ODFReader('compare_lists_submitted_cells_vs_cells_in_paper_May4_2018.ods')
      print(book.sheet_names)
      paper = book.parse('cells_in_paper')
      submitted = book.parse('should_be_submitted')

      server = ENCODED('www.encodeproject.org')

      paper_cells = set(paper['all_cells_in_manuscript'])
      submitted_cells = set(submitted['submitted_library_ids'])
      for cell in sorted(paper_cells.difference(submitted_cells)):
          alias = 'barbara-wold:{}'.format(cell)
          try:
             body = server.get_json(alias)
              state = ''
          except HTTPError as e:
              state = 'Not found'
          print('{},{}'.format(cell,state))

      #print('cells just in submitted set', ','.join(sorted(submitted_cells.difference(paper_cells))))

  if __name__ == '__main__':
      main()
#+END_SRC

#+RESULTS:
#+begin_example
['cells_in_paper', 'should_be_submitted']
17329_C4,Not found
17330_D12,Not found
17330_D9,Not found
17331_E8,Not found
17332_F1,Not found
17332_F3,Not found
17332_F6,Not found
17332_F7,Not found
17332_F8,Not found
17333_G2,Not found
17333_G6,Not found
17333_G9,Not found
17334_H1,Not found
17334_H3,Not found
17334_H7,Not found
18042_A12,Not found
18042_A4,Not found
18044_C11,Not found
18045_D11,Not found
18045_D2,Not found
18045_D6,Not found
18046_E9,Not found
18048_G10,Not found
18049_H5,Not found
18087_F9,Not found
18251_A2,Not found
18253_C5,Not found
18254_D11,Not found
18254_D5,Not found
18256_F5,Not found
18256_F8,Not found
18256_F9,Not found
18257_G5,Not found
18259_B8,Not found
18260_C11,Not found
18260_C2,Not found
18260_C6,Not found
18261_D3,Not found
18261_D5,Not found
18263_A12,Not found
18263_A4,Not found
18264_B3,Not found
18264_B4,Not found
18264_B8,Not found
18265_C10,Not found
18265_C4,Not found
18266_D1,Not found
18266_D6,Not found
18267_E10,Not found
18267_E3,Not found
18267_E4,Not found
18267_E6,Not found
18268_F1,Not found
18268_F12,Not found
18268_F3,Not found
18268_F7,Not found
18268_F8,Not found
18311_A4,Not found
18312_B4,Not found
18312_B5,Not found
18313_C1,Not found
18313_C10,Not found
18313_C11,Not found
18313_C12,Not found
18313_C5,Not found
18313_C7,Not found
18313_C8,Not found
18314_D2,Not found
18314_D3,Not found
18314_D4,Not found
18314_D7,Not found
18315_E12,Not found
18315_E2,Not found
18315_E4,Not found
18315_E6,Not found
18316_F1,Not found
18316_F10,Not found
18316_F11,Not found
18316_F5,Not found
18317_G3,Not found
18317_G4,Not found
18317_G7,Not found
18317_G8,Not found
18317_G9,Not found
#+end_example

Those were the libraries that weren't submitted...

However, Idan would prefer the whole thing to be replaced with the
newer pooled model.

Working on preparing submission, started altering
prepare_submission_20180430.py to support reading different files.

#+NAME run prepare submission
#+BEGIN_SRC bash
PYTHONPATH=/woldlab/loxcyc/home/diane/proj/htsworkflow:/woldlab/loxcyc/home/diane/src/pandasodf python3 \
  prepare_submission_20180430.py \
     --name submission-20180619 \
     --sheet cells_in_paper \
     --header 0 \
     compare_lists_submitted_cells_vs_cells_in_paper_May4_2018.ods
#+END_SRC

Unfortunately the mirror of htsworkflow is broken on felcat.


** Did we submit what we're supposed to?

| C1_e10.5_mouse_limb_run1_June6_2016            |  87 |
| C1_e10.5_mouse_limb_run2_June20_2016           |  56 |
| C1_e10.5_mouse_limb_run3_Dec5_2016             |  32 |
| C1_mouse_e11.0_limb_mesenchyme_mm10_run5       |  58 |
| C1_mouse_e11.5_limb_mesenchyme_mm10_run6       |  80 |
| C1_mouse_e12.5_limb_mesenchyme_mm10_run7       |  76 |
| C1_mouse_e13.5_limb_mesenchyme_mm10_run4       |  71 |
| C1_mouse_e13.5_limb_mesenchyme_mm10_run8       |  64 |
| C1_mouse_e10.5_forelimb_run15_January13AM_2018 |  18 |
| C1_mouse_e11.0_forelimb_run16_January13PM_2018 |  14 |
| C1_mouse_e11.5_forelimb_run10_December11_2017  |  77 |
| C1_mouse_e12.0_forelimb_run11_December12_2017  |  77 |
| C1_mouse_e13.0_forelimb_run12_December13_2017  |  72 |
| C1_mouse_e14.0_forelimb_run13_December14_2017  |  53 |
| C1_mouse_e14.5_forelimb_run17_January16_2018   |  27 |
| C1_mouse_e15.5_forelimb_run14_December15_2017  |  58 |
|                                                | 920 |
#+TBLFM: @17$2=vsum(@1$2..@16$2)

Paper sheet says 920 sum of aliases in tsvs sumbs to 920.
whew

** Barbara wants all the fastqs to be the same length. 50.

Built a set of submission metadata with "everything" included

#+BEGIN_SRC python :results output
import pandas
from pprint import pprint
df = pandas.read_csv('submission-20180928-flowcell-details.tsv', sep='\t')
pprint(set(df[df['read_length'] == 101]['experiment']))

#+END_SRC

#+RESULTS:
: {'C1_e10.5_mouse_limb_run3_Dec5_2016',
:  'C1_mouse_e13.5_limb_mesenchyme_mm10_run4',
:  'C1_mouse_e11.0_limb_mesenchyme_mm10_run5',
:  'C1_mouse_e11.5_limb_mesenchyme_mm10_run6',
:  'C1_mouse_e14.0_forelimb_run13_December14_2017'}

Those are the ones with 100 bp

* <2018-10-01 Mon> Jason found 5 experiments all labeled e13.5


| Experiment  | Description    | Date               |
| ENCSR311IKT | C1 e13.5 run 8 | September 26, 2018 |
| ENCSR839DYB | C1 e13.5 run 4 | September 28, 2018 |
| ENCSR787QXE | 10x            | January 29, 2018   |
| ENCSR530WGW | C1 e13.5 run 4 | July 1, 2017       |
| ENCSR255XZG | C1 e13.5 run 8 | June 30, 2017      |
|             |                |                    |

One of those is a 10x submission

two of those are the original many replicate submission, and two are
the new pooled submission.

The question is what, if any experiments should be merged together?

#+BEGIN_SRC python
  accessions = [
      'ENCSR723FBU', 'ENCSR062KGY', 'ENCSR559CDN', 'ENCSR881ZYX',
      'ENCSR182LFI', 'ENCSR652JLT', 'ENCSR839DYB', 'ENCSR311IKT',
      'ENCSR134JVO', 'ENCSR160DGP', 'ENCSR220RKA', 'ENCSR716HQB',
      'ENCSR182WHH', 'ENCSR938RJZ', 'ENCSR546KIB', 'ENCSR430OIC',
  ]

  from htsworkflow.submission.encoded import ENCODED

  server = ENCODED('www.encodeproject.org')
  server.load_netrc()

  results = []
  for accession in accessions:
      experiment = server.get_json(accession)
      for replicate in experiment['replicates']:
          library = replicate['library']
          biosample = library['biosample']
          results.append([
              accession,
              experiment['description'],
              library['accession'],
              biosample['accession'],
              biosample['date_obtained']])

  results = sorted(results, key=lambda x: x[1])
  results.insert(0, ['Experiment', 'Description', 'Library', 'Biosample', 'Date obtained'])
  return results
#+END_SRC

#+RESULTS:
| Experiment  | Description                    | Library     | Biosample   | Date obtained |
| ENCSR062KGY | C1 e10.5 mouse forelimb run 1  | ENCLB724RNK | ENCBS554MMC |    2016-06-06 |
| ENCSR723FBU | C1 e10.5 mouse forelimb run 2  | ENCLB971JGJ | ENCBS296NSC |    2016-06-20 |
| ENCSR559CDN | C1 e10.5 mouse forelimb run 3  | ENCLB864BFK | ENCBS439GGN |    2016-12-05 |
| ENCSR134JVO | C1 e10.5 mouse forelimb run 15 | ENCLB142PSQ | ENCBS183GJD |    2018-01-13 |
| ENCSR881ZYX | C1 e11.0 mouse forelimb run 5  | ENCLB442WTN | ENCBS661XMW |    2017-01-23 |
| ENCSR160DGP | C1 e11.0 mouse forelimb run 16 | ENCLB137HIJ | ENCBS790VEC |    2018-01-13 |
| ENCSR182LFI | C1 e11.5 mouse forelimb run 6  | ENCLB391AEB | ENCBS366ZCP |    2017-01-31 |
| ENCSR220RKA | C1 e11.5 mouse forelimb run 10 | ENCLB588VQM | ENCBS589YXS |    2017-12-11 |
| ENCSR716HQB | C1 e12.0 mouse forelimb run 11 | ENCLB685FNO | ENCBS875OEX |    2017-12-12 |
| ENCSR652JLT | C1 e12.5 mouse forelimb run 7  | ENCLB880HUG | ENCBS471HOV |    2017-02-01 |
| ENCSR182WHH | C1 e13.0 mouse forelimb run 12 | ENCLB573UWE | ENCBS800RRA |    2017-12-13 |
| ENCSR839DYB | C1 e13.5 mouse forelimb run 4  | ENCLB119UWL | ENCBS841DUB |    2017-01-19 |
| ENCSR311IKT | C1 e13.5 mouse forelimb run 8  | ENCLB948WTO | ENCBS306QOG |    2017-02-23 |
| ENCSR938RJZ | C1 e14.0 mouse forelimb run 13 | ENCLB812YXV | ENCBS621IQO |    2017-12-14 |
| ENCSR546KIB | C1 e14.5 mouse forelimb run 17 | ENCLB673LNA | ENCBS375BFM |    2018-01-16 |
| ENCSR430OIC | C1 e15.5 mouse forelimb run 14 | ENCLB736JSQ | ENCBS849XJR |    2017-12-15 |

After discussion it was decided it was best to leave them
separate. The dissections and library building work were done at
different times.

* <2018-10-01 Mon> Do we still have all the dagman files?

#+BEGIN_SRC python :results output
  import os
  from glob import glob
  from generate_combined_transcript_C1 import ASOF_RUN17_library_files

  commands = ['star_dir', 'rsem_dir']
  version_name = 'Version: '
  results = {}
  for name in ASOF_RUN17_library_files.split():
      name = name.strip()
      dirname, _ = os.path.split(os.path.expanduser(name))
      for dagman in glob(dirname + '/*.dagman'):
          with open(dagman, 'rt') as instream:
              for line in instream:
                  version = line.find(version_name)
                  if version >= 0:
                      version_id = line[version:].strip()
                      results.setdefault(dagman, {}).setdefault(version_name, set()).add(version_id)
                  for command in commands:
                      location = line.find(command)
                      if location >= 0:
                          path = line[location+len(command)+2: -2]
                          results.setdefault(dagman, {}).setdefault(command, set()).add(path)

          print(dagman)
          for command in commands:
              print('  ', results[dagman].get(command, ''))
          if version_name in results[dagman]:
              print('  ', results[dagman][version_name])

  #return results
#+END_SRC

#+RESULTS:
#+begin_example
/woldlab/castor/home/sau/flowcells/H5LV3BCXY/run.dagman
   {'/woldlab/castor/proj/programs/STAR-2.5.2a/source/'}
   {'/woldlab/castor/home/diane/proj/long-rna-seq-pipeline/rsem/'}
   {'Version: 0.9-69-gf738e7'}
/woldlab/castor/home/sau/flowcells/H5LV3BCXY/rebuild-bam.dagman
   {'/woldlab/castor/proj/programs/STAR-2.5.2a/source/'}

   {'Version: 0.9-69-gf738e7'}
/woldlab/castor/home/sau/flowcells/H5LV3BCXY/H5LV3BCXY.dagman
   {'/woldlab/castor/home/diane/proj/long-rna-seq-pipeline/star/source/'}
   {'/woldlab/castor/home/diane/proj/long-rna-seq-pipeline/rsem/'}
/woldlab/castor/home/sau/flowcells/C1_e10.5_mouse_limb_run2_June20_2016/single-cell.dagman
   {'/woldlab/castor/home/diane/proj/long-rna-seq-pipeline/star/source/'}
   {'/woldlab/castor/home/diane/proj/long-rna-seq-pipeline/rsem/'}
/woldlab/castor/home/sau/flowcells/C1_e10.5_mouse_limb_run2_June20_2016/rebuild-bam.dagman
   {'/woldlab/castor/proj/programs/STAR-2.5.2a/source/'}

   {'Version: 0.9-69-gf738e7'}
/woldlab/castor/home/sau/flowcells/C1_e10.5_mouse_limb_run2_June20_2016/run.dagman
   {'/woldlab/castor/proj/programs/STAR-2.5.2a/source/'}
   {'/woldlab/castor/home/diane/proj/long-rna-seq-pipeline/rsem/'}
   {'Version: 0.9-69-gf738e7'}
/woldlab/loxcyc/home/diane/proj/C1_e10.5_mouse_limb_run3_Dec5_2016_2/run.dagman
   {'/woldlab/castor/proj/programs/STAR-2.5.2a/bin/Linux_x86_64/'}
   {'/woldlab/castor/home/diane/proj/long-rna-seq-pipeline/rsem/'}
/woldlab/castor/home/sau/flowcells/C1_mouse_limb_combined_Mar_2017/run_mm10.dagman
   {'/woldlab/castor/proj/programs/STAR-2.5.2a/source/'}
   {'/woldlab/castor/home/diane/proj/long-rna-seq-pipeline/rsem/'}
/woldlab/castor/home/sau/flowcells/C1_mouse_limb_combined_Mar_2017/rebuild_bam.dagman
   {'/woldlab/castor/proj/programs/STAR-2.5.2a/source/'}

   {'Version: 0.9-69-gf738e7'}
/woldlab/castor/home/sau/flowcells/C1_mouse_limb_combined_Mar_2017/run.dagman
   {'/woldlab/castor/proj/programs/STAR-2.5.2a/source/'}
   {'/woldlab/castor/home/diane/proj/long-rna-seq-pipeline/rsem/'}
/woldlab/castor/home/sau/flowcells/C1_mouse_limb_combined_Mar_2017/run_mm10_clean.dagman
   {'/woldlab/castor/proj/programs/STAR-2.5.2a/source/'}
   {'/woldlab/castor/home/diane/proj/long-rna-seq-pipeline/rsem/'}
/woldlab/castor/home/sau/flowcells/C1_mouse_limb_combined_Mar_2017/new_seed.dagman
   {'/woldlab/castor/proj/programs/STAR-2.5.2a/source/'}
   {'/woldlab/castor/home/diane/proj/long-rna-seq-pipeline/rsem/'}
/woldlab/castor/home/sau/flowcells/HFNLNBCX2/run_trim.dagman
   {'/woldlab/castor/proj/programs/STAR-2.5.2a/source/'}
   {'/woldlab/castor/home/diane/proj/long-rna-seq-pipeline/rsem/'}
   {'Version: 0.9-69-gf738e7'}
/woldlab/castor/home/sau/flowcells/HFNLNBCX2/run-20090_C12.dagman
   {'/woldlab/castor/proj/programs/STAR-2.5.2a/source/'}
   {'/woldlab/castor/home/diane/proj/long-rna-seq-pipeline/rsem/'}
   {'Version: 0.9-69-gf738e7'}
/woldlab/castor/home/sau/flowcells/H7CNTBCX2/run.dagman
   {'/woldlab/castor/proj/programs/STAR-2.5.2a/source/'}
   {'/woldlab/castor/home/diane/proj/long-rna-seq-pipeline/rsem/'}
   {'Version: 0.9-32-g4adccc'}
/woldlab/castor/home/sau/flowcells/HFNLTBCX2/run.dagman
   {'/woldlab/castor/proj/programs/STAR-2.5.2a/source/'}
   {'/woldlab/castor/home/diane/proj/long-rna-seq-pipeline/rsem/'}
   {'Version: 0.9-69-gf738e7'}
/woldlab/castor/home/sau/flowcells/HF7NTBCX2/run.dagman
   {'/woldlab/castor/proj/programs/STAR-2.5.2a/source/'}
   {'/woldlab/castor/home/diane/proj/long-rna-seq-pipeline/rsem/'}
   {'Version: 0.9-69-gf738e7'}
/woldlab/castor/home/sau/flowcells/HFNYNBCX2/run.dagman
   {'/woldlab/castor/proj/programs/STAR-2.5.2a/source/'}
   {'/woldlab/castor/home/diane/proj/long-rna-seq-pipeline/rsem/'}
   {'Version: 0.9-69-gf738e7'}
#+end_example

We have all of them.... though... then there's the problem telling
them apart.

Argh face palm. RELEASE_VERSION file wasn't being updated. Also that
commit id doesn't seem to exist anymore.


* <2018-10-09 Tue> I probably should match dagmans up to what quantifications went into the master table

I looked in [[file:generate_combined_C1.py::~sau/flowcells/H5LV3BCXY/C1_e10.5_mouse_limb_run1_June6_2016_FPKM.csv][generate_combined_C1.py]] for the list of FPKM files used
and we definitely used the run1 and run2 files that were generated
with STAR 2.4.0k

So... how different _are_ they?

[[file:compare_star_versions.py][compare_star_versions.py]]

So... how different is the same version of star?

#+BEGIN_SRC bash
for d in H5LV3BCXY_2 H5LV3BCXY_3; do
  pushd $d
  for f in ~sau/flowcells/H5LV3BCXY/*.fastq.gz; do ln -s $f ; done
  cp ~sau/flowcells/H5LV3BCXY/library.tsv .
  cp ~sau/flowcells/H5LV3BCXY/experiments.tsv .
  tail -n +2 library.tsv | cut -f 2 | xargs mkdir
  PYTHONPATH=~sau/flowcells/rna_pipelines/long-rna-seq-condor/ \
    python3 -m woldrnaseq.make_dag -l library.tsv > run.dagman
  popd
done
#+END_SRC

#+RESULTS:
| ~/proj/C1_mouse_limb_combined/H5LV3BCXY_2 | ~/proj/C1_mouse_limb_combined |
| ~/proj/C1_mouse_limb_combined             |                               |
| ~/proj/C1_mouse_limb_combined/H5LV3BCXY_3 | ~/proj/C1_mouse_limb_combined |
| ~/proj/C1_mouse_limb_combined             |                               |

#+BEGIN_SRC bash
for d in H5LV3BCXY H5LV3BCXY_2 H5LV3BCXY_3; do
  pushd $d >> /dev/null
  for q in FPKM TPM expected_count; do
    PYTHONPATH=~sau/flowcells/rna_pipelines/long-rna-seq-condor/ \
      python3 -m woldrnaseq.makersemcsv -l library.tsv -e experiments.tsv \
              -q ${q}
  done
  popd >> /dev/null
done
#+END_SRC

#+RESULTS:

#+BEGIN_SRC bash
for q in FPKM TPM expected_count; do
  for d in H5LV3BCXY H5LV3BCXY_2 H5LV3BCXY_3; do
  pushd $d >> /dev/null
    sha256sum C1_e10.5_mouse_limb_run1_June6_2016_gene_${q}.csv
  popd >> /dev/null
  done
done
#+END_SRC

#+RESULTS:
| b64b9b263e10ebc6c15f616869d9793753b06d3461e61fe1aa32cdd9c6e5a470 | C1_e10.5_mouse_limb_run1_June6_2016_gene_FPKM.csv           |
| b64b9b263e10ebc6c15f616869d9793753b06d3461e61fe1aa32cdd9c6e5a470 | C1_e10.5_mouse_limb_run1_June6_2016_gene_FPKM.csv           |
| b64b9b263e10ebc6c15f616869d9793753b06d3461e61fe1aa32cdd9c6e5a470 | C1_e10.5_mouse_limb_run1_June6_2016_gene_FPKM.csv           |
| 8ea439e69727d441de54b6a2eec7dd316bedc821d2ff78459408ad2c4172e936 | C1_e10.5_mouse_limb_run1_June6_2016_gene_TPM.csv            |
| 8ea439e69727d441de54b6a2eec7dd316bedc821d2ff78459408ad2c4172e936 | C1_e10.5_mouse_limb_run1_June6_2016_gene_TPM.csv            |
| 8ea439e69727d441de54b6a2eec7dd316bedc821d2ff78459408ad2c4172e936 | C1_e10.5_mouse_limb_run1_June6_2016_gene_TPM.csv            |
| f069df455ff7c9b38eba5e86ec3d1ab71d145e4fdad512ae4cd38b8a7fa593fe | C1_e10.5_mouse_limb_run1_June6_2016_gene_expected_count.csv |
| 9ea2d2758cea6f668c06e3b15938ceb808512e413e80dfd1e338f7b8498f51ac | C1_e10.5_mouse_limb_run1_June6_2016_gene_expected_count.csv |
| 0b57e6111e7177fe2fdb22d471f09f695ec0f87b6e7e06bd6f5d977bdc159c09 | C1_e10.5_mouse_limb_run1_June6_2016_gene_expected_count.csv |
                                 C1_e10.5_mouse_limb_run1_June6_2016_gene_FPKM
Make sure run2 reproduces
#+BEGIN_SRC bash
for d in C1_e10.5_mouse_limb_run2_June20_2016_2 C1_e10.5_mouse_limb_run2_June20_2016_3; do
  mkdir $d
  pushd $d >> /dev/null
  for f in ~sau/flowcells/C1_e10.5_mouse_limb_run2_June20_2016/*.fastq.gz; do ln -s $f ; done
  cp ~sau/flowcells/C1_e10.5_mouse_limb_run2_June20_2016/library.tsv .
  cp ~sau/flowcells/C1_e10.5_mouse_limb_run2_June20_2016/experiments.tsv .
  tail -n +2 library.tsv | cut -f 2 | xargs mkdir
  PYTHONPATH=~sau/flowcells/rna_pipelines/long-rna-seq-condor/ \
    python3 -m woldrnaseq.make_dag -l library.tsv > run.dagman
  popd >> /dev/null
done
#+END_SRC

#+BEGIN_SRC bash
for d in C1_e10.5_mouse_limb_run2_June20_2016 \
         C1_e10.5_mouse_limb_run2_June20_2016_2 \
         C1_e10.5_mouse_limb_run2_June20_2016_3; do
  pushd $d >> /dev/null
  for q in FPKM TPM expected_count; do
    PYTHONPATH=~sau/flowcells/rna_pipelines/long-rna-seq-condor/ \
      python3 -m woldrnaseq.makersemcsv -l library.tsv -e all-in-one-experiment.tsv \
              -q $q
  done
  popd >> /dev/null
done
#+END_SRC

#+RESULTS:


#+BEGIN_SRC bash
for q in FPKM TPM expected_count; do
  for d in C1_e10.5_mouse_limb_run2_June20_2016 \
           C1_e10.5_mouse_limb_run2_June20_2016_2 \
           C1_e10.5_mouse_limb_run2_June20_2016_3; do
  pushd $d >> /dev/null
    sha256sum C1_e10.5_mouse_limb_run2_June20_2016_gene_${q}.csv
  popd >> /dev/null
  done
done
#+END_SRC

#+RESULTS:
| 166027605587ee167db523eb7a483b1f40f42f35573c38537f4976e98f94d001 | C1_e10.5_mouse_limb_run2_June20_2016_gene_FPKM.csv           |
| 166027605587ee167db523eb7a483b1f40f42f35573c38537f4976e98f94d001 | C1_e10.5_mouse_limb_run2_June20_2016_gene_FPKM.csv           |
| 166027605587ee167db523eb7a483b1f40f42f35573c38537f4976e98f94d001 | C1_e10.5_mouse_limb_run2_June20_2016_gene_FPKM.csv           |
| 3bc1ba838e682edb1c37d16900c4a1f73b6451757490be07fa4d0a10938cbdf9 | C1_e10.5_mouse_limb_run2_June20_2016_gene_TPM.csv            |
| 3bc1ba838e682edb1c37d16900c4a1f73b6451757490be07fa4d0a10938cbdf9 | C1_e10.5_mouse_limb_run2_June20_2016_gene_TPM.csv            |
| 3bc1ba838e682edb1c37d16900c4a1f73b6451757490be07fa4d0a10938cbdf9 | C1_e10.5_mouse_limb_run2_June20_2016_gene_TPM.csv            |
| 7ecf2cb62bfe421260b6a9a1263855ff44c7797fee098cc17a47eeddef4d9cf5 | C1_e10.5_mouse_limb_run2_June20_2016_gene_expected_count.csv |
| 15b223b1f262dd5cbd81ef15c9d08657e38e0e14b2d56acd4cbd65cef1ef6612 | C1_e10.5_mouse_limb_run2_June20_2016_gene_expected_count.csv |
| 5f76acd9f0537898d496316adb755de95cc6f4ed6012a650377d7f454fd31d51 | C1_e10.5_mouse_limb_run2_June20_2016_gene_expected_count.csv |

Henry wondered if the ReadsPerGene.out.tab was reproducible
Run 1
#+BEGIN_SRC bash
for d in H5LV3BCXY H5LV3BCXY_2 H5LV3BCXY_3; do
  pushd $d >> /dev/null
  for a in $(find . -name ReadsPerGene.out.tab | sort); do sha256sum $a ; done | sha256sum
  popd >> /dev/null
done
#+END_SRC

#+RESULTS:
| 684042af8299c2b2c0748db95f1d839adb9e7b780ad114959ed29f51989d0930 | 0 |
| 684042af8299c2b2c0748db95f1d839adb9e7b780ad114959ed29f51989d0930 | 0 |
| 684042af8299c2b2c0748db95f1d839adb9e7b780ad114959ed29f51989d0930 | 0 |

Run 2
#+BEGIN_SRC bash
for d in C1_e10.5_mouse_limb_run2_June20_2016 \
         C1_e10.5_mouse_limb_run2_June20_2016_2 \
         C1_e10.5_mouse_limb_run2_June20_2016_3; do
  pushd $d >> /dev/null
  for a in $(find . -name ReadsPerGene.out.tab | sort); do sha256sum $a ; done | sha256sum
  popd >> /dev/null
done
#+END_SRC

#+RESULTS:
| 244e3574879f1ff59ef5584d680f1c12dbaa8eec24e383a04735265a582c4924 | 0 |
| 244e3574879f1ff59ef5584d680f1c12dbaa8eec24e383a04735265a582c4924 | 0 |
| 244e3574879f1ff59ef5584d680f1c12dbaa8eec24e383a04735265a582c4924 | 0 |


#+BEGIN_SRC python :results output
  import pandas
  import os

  df = pandas.read_csv('compare_bams_genome.csv', index_col=0)

  for column in df:
      data = df[column]
      if len(set(data)) > 1:
          print(column, set(data))

  print('done')

#+END_SRC

#+RESULTS:
: done

Implies that all of the genome alignments are reproducible

* Are all the expected bulk libraries present?
  <2018-10-15 Mon>

#+BEGIN_SRC python
  import pandas
  from htsworkflow.submission.encoded import ENCODED

  server = ENCODED('www.encodeproject.org')

  sheet = pandas.read_excel(
      'Mouse embryo samples list library numbers Diane August 21 2017.xlsx',
      dtype={'Library number': str,
             'biorep': str})

  status = []
  for library_id in sheet['Library number']:
      if not (pandas.isnull(library_id) or library_id == 'nan'):
          url = '/library/barbara-wold:{}/'.format(library_id)
          library = server.get_json(url)
          status.append((library['accession'], library['status']))

  return status

#+END_SRC

#+RESULTS:
| ENCLB029BTN | released |
| ENCLB286HEN | released |
| ENCLB257LEX | released |
| ENCLB396XZV | released |
| ENCLB554ZAM | released |
| ENCLB838FEJ | released |
| ENCLB293YOF | released |
| ENCLB247JXW | released |
| ENCLB564JOZ | released |
| ENCLB688RET | released |
| ENCLB537WPK | released |
| ENCLB682KXD | released |
| ENCLB835LVO | released |
| ENCLB471QMM | released |
| ENCLB659UFY | released |
| ENCLB426JKF | released |
| ENCLB454ZUS | released |
| ENCLB061TDP | released |
| ENCLB331VAA | released |
| ENCLB761PCA | released |
| ENCLB601XLL | released |
| ENCLB347FRI | released |
| ENCLB055KYV | released |
| ENCLB357KYA | released |
| ENCLB495FUZ | released |
| ENCLB979DZW | released |
| ENCLB162EJJ | released |
| ENCLB627LDZ | released |
| ENCLB204IPP | released |
| ENCLB214HEI | released |
| ENCLB839VOV | released |
| ENCLB187TEZ | released |
| ENCLB408EFI | released |
| ENCLB008IOE | released |
| ENCLB613DIH | released |
| ENCLB230FGL | released |
| ENCLB656OMB | released |
| ENCLB637CNF | released |
| ENCLB968JLC | released |
| ENCLB432GJF | released |
| ENCLB878ALV | released |
| ENCLB673NRF | released |
| ENCLB222KWY | released |
| ENCLB224ETE | released |
| ENCLB177SFU | released |
| ENCLB807ODU | released |
| ENCLB051RZO | released |
| ENCLB426MFX | released |
| ENCLB312IAF | released |
| ENCLB517UIN | released |
| ENCLB032PUJ | released |
| ENCLB304NDN | released |
| ENCLB690TFQ | released |
| ENCLB351WRP | released |
| ENCLB238AFW | released |
| ENCLB724HXC | released |
| ENCLB504REE | released |
| ENCLB863LLT | released |
| ENCLB302GKB | released |
| ENCLB327XFF | released |
| ENCLB336GOL | released |
| ENCLB964APA | released |
| ENCLB000EUQ | released |
| ENCLB597GRF | released |
| ENCLB989QNS | released |
| ENCLB567WFL | released |
| ENCLB254AMJ | released |
| ENCLB015WCJ | released |
| ENCLB200EFP | released |
| ENCLB278MMD | released |
| ENCLB819PZM | released |
| ENCLB220DVX | released |
| ENCLB906TKN | released |
| ENCLB949YQN | released |
| ENCLB584VFZ | released |
| ENCLB931ORG | released |
| ENCLB409LKR | released |
| ENCLB595PNG | released |
| ENCLB156EMG | released |
| ENCLB030NEC | released |
| ENCLB377PCX | released |
| ENCLB214UZM | released |
| ENCLB813BQB | released |
| ENCLB949WIO | released |
| ENCLB373ANW | released |
| ENCLB567JQE | released |
| ENCLB073YDX | released |
| ENCLB028XWK | released |
| ENCLB507CWD | released |
| ENCLB614EHD | released |
| ENCLB526KEI | released |
| ENCLB835IBO | released |
| ENCLB873UUE | released |
| ENCLB975KAO | released |
| ENCLB215FCS | released |
| ENCLB599UVX | released |
| ENCLB079XWZ | released |
| ENCLB042OTC | released |
| ENCLB753FMG | released |
| ENCLB110FBI | released |
| ENCLB783FQC | released |
| ENCLB209CGK | released |
| ENCLB646LEJ | released |
| ENCLB105VLP | released |
| ENCLB150ZJS | released |
| ENCLB256STD | released |
| ENCLB082UHO | released |
| ENCLB672ISU | released |
| ENCLB430WXG | released |
| ENCLB026UUS | released |
| ENCLB733PDT | released |
| ENCLB841PIC | released |
| ENCLB662TIG | released |
| ENCLB987VRV | released |
| ENCLB696ITY | released |
| ENCLB535BBV | released |
| ENCLB489BJY | released |
| ENCLB424YVG | released |
| ENCLB123VIC | released |
| ENCLB626WMA | released |
| ENCLB287BOO | released |
| ENCLB008KBU | released |
| ENCLB496KJW | released |
| ENCLB540BPI | released |
| ENCLB852NKM | released |
| ENCLB732ZDB | released |
| ENCLB266LCY | released |
| ENCLB055JUC | released |
| ENCLB080NNG | released |
| ENCLB180OTB | released |
| ENCLB274VUA | released |
| ENCLB441AFS | released |
| ENCLB790ZKD | released |
| ENCLB319NLX | released |
| ENCLB074REG | released |
| ENCLB415KPR | released |
| ENCLB658ICO | released |
| ENCLB741KQB | released |
| ENCLB810TRL | released |
| ENCLB544VIE | released |
| ENCLB370ZFK | released |
| ENCLB273BPC | released |
| ENCLB847UDV | released |
| ENCLB704CYQ | released |
| ENCLB318WHF | released |
| ENCLB590UZK | released |
| ENCLB260QNG | released |
| ENCLB817LXB | released |
| ENCLB169SNA | released |
| ENCLB459OYG | released |
| ENCLB217DSV | released |
| ENCLB159SLV | released |
| ENCLB022VFG | released |
| ENCLB416HZP | released |
| ENCLB556YSG | released |
| ENCLB803HJK | released |

* They want just the 920 cells as a site to be used.

Generated new virtual directory using notebook [[file:make-paper-vdir.ipynb][make-paper-vdir.ipynb]]

#+BEGIN_SRC bash
cd paper_analysis_vdir
if [ \! -e paper_by_cluster ]; then
    mkdir paper_by_cluster
fi

PYTHONPATH=/woldlab/loxcyc/home/diane/proj/trackhub \
python3 -m woldrnaseq.make_trackhub \
  --hub paper_by_cluster \
  --short-name paper_by_cluster \
  --long-name "paper 920 cells by cluster" \
  --email diane@caltech.edu \
  --bigwig \
  -o paper_by_cluster \
  -w http://woldlab.caltech.edu/~diane/C1_mouse_limb_timecourse \
  -l library_vdir.tsv \
  -e experiment_cluster.tsv
#+END_SRC

#+RESULTS:
| sending                      | incremental                                                                         |  file | list       |         |       |            |           |            |         |         |             |
| paper_by_cluster.genomes.txt |                                                                                     |       |            |         |       |            |           |            |         |         |             |
|                              | 38                                                                                  |  100% | 0.00kB/s   | 0:00:00 |       |         38 |      100% | 0.00kB/s   | 0:00:00 | (xfr#1, | to-chk=3/5) |
| paper_by_cluster.hub.txt     |                                                                                     |       |            |         |       |            |           |            |         |         |             |
|                              | 137                                                                                 |  100% | 133.79kB/s | 0:00:00 |       |        137 |      100% | 133.79kB/s | 0:00:00 | (xfr#2, | to-chk=2/5) |
| mm10/trackDb.txt             |                                                                                     |       |            |         |       |            |           |            |         |         |             |
|                              | 32,768                                                                              |   18% | 31.25MB/s  | 0:00:00 |       |    179,160 |      100% | 34.17MB/s  | 0:00:00 | (xfr#3, | to-chk=0/5) |
|                              |                                                                                     |       |            |         |       |            |           |            |         |         |             |
| sent                         | 179,666                                                                             | bytes | received   |      82 | bytes | 359,496.00 | bytes/sec |            |         |         |             |
| total                        | size                                                                                |    is | 179,335    | speedup | is    |        1.0 |           |            |         |         |             |
| trackhub:                    | http://woldlab.caltech.edu/~diane/C1_mouse_limb_timecourse/paper_by_cluster.hub.txt |       |            |         |       |            |           |            |         |         |             |

http://genome.ucsc.edu/cgi-bin/hgTracks?db=mm10&hubUrl=http://woldlab.caltech.edu/~diane/C1_mouse_limb_timecourse/paper_by_cluster/paper_by_cluster.hub.txt

#+BEGIN_SRC bash
cd paper_analysis_vdir
if [ \! -e paper_by_mesenchyme ]; then
    mkdir paper_by_mesenchyme
fi

PYTHONPATH=/woldlab/loxcyc/home/diane/proj/trackhub \
python3 -m woldrnaseq.make_trackhub \
  --hub paper_by_cluster_mesenchyme \
  --short-name paper_by_mesenchyme \
  --long-name "paper 920 cells mesenchyme" \
  --email diane@caltech.edu \
  --bigwig \
  -o paper_by_mesenchyme \
  -w http://woldlab.caltech.edu/~diane/C1_mouse_limb_timecourse \
  -l library_vdir.tsv \
  -e experiment_cluster_mesenchyme.tsv
#+END_SRC

#+RESULTS:
| sending                                 | incremental                                                                                    |  file | list       |         |       |            |           |            |         |         |             |
| paper_by_cluster_mesenchyme.genomes.txt |                                                                                                |       |            |         |       |            |           |            |         |         |             |
|                                         | 38                                                                                             |  100% | 0.00kB/s   | 0:00:00 |       |         38 |      100% | 0.00kB/s   | 0:00:00 | (xfr#1, | to-chk=3/5) |
| paper_by_cluster_mesenchyme.hub.txt     |                                                                                                |       |            |         |       |            |           |            |         |         |             |
|                                         | 151                                                                                            |  100% | 147.46kB/s | 0:00:00 |       |        151 |      100% | 147.46kB/s | 0:00:00 | (xfr#2, | to-chk=2/5) |
| mm10/                                   |                                                                                                |       |            |         |       |            |           |            |         |         |             |
| mm10/trackDb.txt                        |                                                                                                |       |            |         |       |            |           |            |         |         |             |
|                                         | 32,768                                                                                         |    6% | 31.25MB/s  | 0:00:00 |       |    484,413 |      100% | 66.00MB/s  | 0:00:00 | (xfr#3, | to-chk=0/5) |
|                                         |                                                                                                |       |            |         |       |            |           |            |         |         |             |
| sent                                    | 485,014                                                                                        | bytes | received   |      85 | bytes | 970,198.00 | bytes/sec |            |         |         |             |
| total                                   | size                                                                                           |    is | 484,602    | speedup | is    |        1.0 |           |            |         |         |             |
| trackhub:                               | http://woldlab.caltech.edu/~diane/C1_mouse_limb_timecourse/paper_by_cluster_mesenchyme.hub.txt |       |            |         |       |            |           |            |         |         |             |


http://genome.ucsc.edu/cgi-bin/hgTracks?db=mm10&hubUrl=http://woldlab.caltech.edu/~diane/C1_mouse_limb_timecourse/paper_by_mesenchyme/paper_by_mesenchyme.hub.txt

#+BEGIN_SRC bash
cd paper_analysis_vdir
if [ \! -e paper_by_perichondrium ]; then
    mkdir paper_by_perichondrium
fi

PYTHONPATH=/woldlab/loxcyc/home/diane/proj/trackhub \
python3 -m woldrnaseq.make_trackhub \
  --hub paper_by_cluster_perichondrium \
  --short-name paper_by_perichondrium \
  --long-name "paper 920 cells perichondrium" \
  --email diane@caltech.edu \
  --bigwig \
  -o paper_by_perichondrium \
  -w http://woldlab.caltech.edu/~diane/C1_mouse_limb_timecourse \
  -l library_vdir.tsv \
  -e experiment_cluster_perichondrium.tsv
#+END_SRC

#+RESULTS:
| sending                                    | incremental                                                                                       |  file | list       |         |       |            |           |            |         |         |             |
| paper_by_cluster_perichondrium.genomes.txt |                                                                                                   |       |            |         |       |            |           |            |         |         |             |
|                                            | 38                                                                                                |  100% | 0.00kB/s   | 0:00:00 |       |         38 |      100% | 0.00kB/s   | 0:00:00 | (xfr#1, | to-chk=3/5) |
| paper_by_cluster_perichondrium.hub.txt     |                                                                                                   |       |            |         |       |            |           |            |         |         |             |
|                                            | 160                                                                                               |  100% | 156.25kB/s | 0:00:00 |       |        160 |      100% | 156.25kB/s | 0:00:00 | (xfr#2, | to-chk=2/5) |
| mm10/                                      |                                                                                                   |       |            |         |       |            |           |            |         |         |             |
| mm10/trackDb.txt                           |                                                                                                   |       |            |         |       |            |           |            |         |         |             |
|                                            | 32,768                                                                                            |   27% | 31.25MB/s  | 0:00:00 |       |    119,491 |      100% | 113.96MB/s | 0:00:00 | (xfr#3, | to-chk=0/5) |
|                                            |                                                                                                   |       |            |         |       |            |           |            |         |         |             |
| sent                                       | 120,059                                                                                           | bytes | received   |      85 | bytes | 240,288.00 | bytes/sec |            |         |         |             |
| total                                      | size                                                                                              |    is | 119,689    | speedup | is    |        1.0 |           |            |         |         |             |
| trackhub:                                  | http://woldlab.caltech.edu/~diane/C1_mouse_limb_timecourse/paper_by_cluster_perichondrium.hub.txt |       |            |         |       |            |           |            |         |         |             |

http://genome.ucsc.edu/cgi-bin/hgTracks?db=mm10&hubUrl=http://woldlab.caltech.edu/~diane/C1_mouse_limb_timecourse/paper_by_perichondrium/paper_by_cluster_perichondrium.hub.txt
** Subsets

http://genome.ucsc.edu/cgi-bin/hgTracks?db=mm10&hubUrl=http://woldlab.caltech.edu/~diane/C1_mouse_limb_timecourse/subsample_by_cluster/subsample_by_cluster.hub.txt

#+NAME: subset mesenchme
#+BEGIN_SRC python
  import random

  cells = "17327_A10,17327_A11,17327_A3,17327_A5,17327_A7,17327_A8,17328_B11,17328_B12,17328_B4,17328_B6,17329_C2,17329_C4,17329_C6,17329_C7,17330_D1,17330_D12,17330_D2,17330_D4,17330_D5,17330_D8,17330_D9,17331_E2,17331_E3,17331_E6,17331_E7,17331_E8,17331_E9,17332_F1,17332_F2,17332_F3,17332_F6,17332_F8,17333_G1,17333_G3,17333_G9,17334_H1,17334_H7,18042_A1,18042_A11,18042_A12,18042_A2,18042_A3,18042_A5,18042_A6,18042_A8,18042_A9,18043_B1,18043_B10,18043_B11,18043_B12,18043_B3,18043_B4,18043_B5,18043_B6,18043_B7,18043_B8,18043_B9,18044_C1,18044_C10,18044_C11,18044_C12,18044_C2,18044_C3,18044_C4,18044_C7,18044_C8,18045_D1,18045_D10,18045_D11,18045_D12,18045_D2,18045_D4,18045_D5,18045_D6,18045_D7,18045_D8,18046_E1,18046_E10,18046_E2,18046_E6,18046_E7,18046_E9,18047_F1,18047_F10,18047_F11,18047_F12,18047_F2,18047_F3,18047_F4,18047_F5,18047_F6,18047_F7,18047_F8,18047_F9,18048_G1,18048_G10,18048_G11,18048_G12,18048_G3,18048_G5,18048_G6,18048_G7,18049_H1,18049_H10,18049_H2,18049_H3,18049_H4,18049_H5,18049_H6,18049_H7,18049_H8,18049_H9,18087_F1,18087_F10,18087_F11,18087_F12,18087_F2,18087_F3,18087_F4,18087_F5,18087_F7,18087_F9,18088_G1,18088_G10,18088_G11,18088_G12,18088_G3,18088_G5,18088_G6,18088_G7,18088_G9,18089_H1,18089_H10,18089_H11,18089_H2,18089_H3,18089_H4,18089_H5,18089_H6,18089_H7,18089_H8,18089_H9,18251_A11,18253_C1,18253_C11,18254_D5,18256_F7,18257_G7,18258_A1,18258_A10,18258_A11,18258_A12,18258_A2,18258_A3,18258_A5,18258_A6,18258_A8,18258_A9,18259_B1,18259_B10,18259_B11,18259_B12,18259_B2,18259_B3,18259_B4,18259_B5,18259_B6,18259_B7,18259_B8,18259_B9,18260_C1,18260_C10,18260_C11,18260_C12,18260_C2,18260_C3,18260_C4,18260_C5,18260_C6,18260_C7,18260_C9,18261_D1,18261_D10,18261_D11,18261_D12,18261_D2,18261_D3,18261_D4,18261_D5,18261_D6,18261_D7,18261_D8,18261_D9,18262_E1,18262_E10,18262_E12,18262_E3,18262_E5,18262_E7,18262_E8,18262_E9,18263_A10,18263_A11,18263_A12,18263_A3,18263_A4,18263_A5,18263_A6,18263_A7,18263_A8,18263_A9,18264_B1,18264_B11,18264_B12,18264_B2,18264_B3,18264_B5,18264_B7,18264_B8,18265_C1,18265_C10,18265_C11,18265_C12,18265_C2,18265_C3,18265_C4,18265_C5,18265_C7,18265_C8,18265_C9,18266_D1,18266_D10,18266_D11,18266_D12,18266_D2,18266_D3,18266_D4,18266_D5,18266_D6,18266_D7,18266_D8,18266_D9,18267_E1,18267_E10,18267_E12,18267_E2,18267_E3,18267_E4,18267_E7,18267_E8,18268_F1,18268_F10,18268_F11,18268_F12,18268_F2,18268_F3,18268_F4,18268_F5,18268_F7,18268_F8,18268_F9,18269_G1,18269_G10,18269_G11,18269_G2,18269_G3,18269_G4,18269_G5,18269_G7,18269_G8,18269_G9,18270_A1,18270_A2,18270_A5,18270_A6,18270_A7,18270_A8,18271_B11,18271_B3,18271_B7,18271_B8,18272_C1,18272_C12,18272_C2,18272_C3,18272_C4,18272_C6,18272_C8,18272_C9,18273_D1,18273_D2,18273_D4,18273_D5,18273_D6,18273_D8,18274_E1,18274_E10,18274_E11,18274_E12,18274_E2,18274_E6,18275_F1,18275_F11,18275_F2,18275_F3,18275_F5,18276_G1,18276_G2,18276_G3,18276_G5,18276_G6,18276_G7,18276_G9,18311_A4,18311_A7,18313_C1,18313_C12,18313_C7,18313_C8,18314_D12,18314_D3,18314_D4,18314_D7,18314_D8,18314_D9,18315_E12,18315_E4,18316_F3,18316_F5,18316_F8,18317_G4,18317_G6,18317_G7,19906_A1,19906_A10,19906_A11,19906_A12,19906_A2,19906_A3,19906_A4,19906_A5,19906_A6,19906_A7,19906_A8,19906_A9,19907_B1,19907_B10,19907_B11,19907_B12,19907_B2,19907_B4,19907_B5,19907_B6,19907_B7,19907_B8,19907_B9,19908_C10,19908_C11,19908_C12,19908_C2,19908_C3,19908_C4,19908_C5,19908_C6,19908_C7,19908_C8,19908_C9,19909_D1,19909_D10,19909_D12,19909_D2,19909_D3,19909_D4,19909_D5,19909_D6,19909_D7,19909_D8,19909_D9,19910_E1,19910_E10,19910_E11,19910_E2,19910_E3,19910_E4,19910_E5,19910_E6,19910_E7,19910_E8,19910_E9,19911_F1,19911_F10,19911_F11,19911_F12,19911_F2,19911_F3,19911_F4,19911_F5,19911_F6,19911_F7,19911_F8,19911_F9,19912_G11,19912_G12,19912_G2,19912_G3,19912_G4,19912_G6,19912_G7,19912_G8,19912_G9,19913_H1,19913_H10,19913_H11,19913_H12,19913_H2,19913_H3,19913_H4,19913_H5,19913_H6,19913_H7,19913_H8,19913_H9,19914_A1,19914_A10,19914_A11,19914_A2,19914_A3,19914_A4,19914_A5,19914_A6,19914_A7,19914_A8,19914_A9,19915_B1,19915_B10,19915_B11,19915_B6,19916_C12,19916_C2,19916_C8,19917_D3,19917_D6,20026_A1,20026_A10,20026_A11,20026_A2,20026_A3,20026_A4,20026_A7,20027_B10,20027_B11,20027_B12,20027_B2,20027_B3,20027_B4,20027_B5,20027_B6,20027_B7,20027_B8,20027_B9,20028_C1,20028_C10,20028_C11,20028_C3,20028_C4,20028_C5,20028_C6,20028_C7,20028_C8,20028_C9,20029_D1,20029_D11,20029_D12,20029_D2,20029_D3,20029_D5,20029_D7,20029_D8,20029_D9,20030_E10,20030_E11,20030_E12,20030_E2,20030_E3,20030_E4,20030_E5,20030_E6,20030_E7,20030_E8,20030_E9,20031_F1,20031_F10,20031_F11,20031_F12,20031_F2,20031_F3,20031_F4,20031_F5,20031_F6,20031_F7,20032_G1,20032_G3,20032_G4,20033_A1,20033_A10,20033_A11,20033_A12,20033_A2,20033_A5,20033_A7,20033_A8,20033_A9,20034_B1,20034_B10,20034_B11,20034_B12,20034_B2,20034_B4,20034_B5,20034_B7,20034_B8,20035_C1,20035_C10,20035_C11,20035_C12,20035_C2,20035_C5,20035_C6,20036_D1,20036_D10,20036_D12,20036_D2,20036_D5,20036_D6,20036_D7,20036_D9,20037_E1,20037_E10,20037_E11,20037_E12,20037_E2,20037_E3,20037_E4,20037_E5,20037_E6,20037_E8,20037_E9,20038_F10,20038_F3,20038_F4,20038_F5,20038_F6,20038_F7,20038_F8,20039_A10,20039_A5,20039_A8,20040_B11,20040_B9,20041_C3,20041_C8,20042_D10,20042_D11,20042_D12,20042_D8,20043_E1,20047_D11,20047_D5,20048_E10,20048_E5,20049_F6".split(',')
  random.shuffle(cells)
  return(','.join(sorted(cells[:30])))

#+END_SRC

#+RESULTS:
: 17329_C2,17330_D2,17332_F2,17333_G9,18045_D8,18047_F10,18087_F4,18089_H7,18260_C2,18261_D4,18262_E9,18264_B12,18265_C2,18266_D5,18268_F5,18268_F7,18269_G4,18273_D1,18276_G3,18315_E12,19906_A10,19906_A12,19906_A3,19912_G6,19916_C2,20027_B8,20030_E4,20033_A12,20033_A9,20038_F10

#+NAME: subset perichondrium
#+BEGIN_SRC python
  import random
  cells="18251_A4,18251_A8,18252_B2,18252_B4,18252_B5,18252_B9,18253_C10,18253_C12,18253_C3,18253_C5,18253_C6,18253_C7,18253_C9,18254_D1,18254_D11,18254_D4,18254_D7,18254_D8,18255_E1,18255_E6,18256_F4,18256_F5,18256_F6,18256_F9,18257_G2,18257_G5,18257_G8,18267_E5,18270_A9,18271_B1,18271_B12,18273_D12,18273_D3,18273_D9,18274_E8,18275_F4,18276_G4,18311_A1,18311_A12,18311_A2,18311_A8,18312_B1,18312_B5,18312_B9,18313_C3,18313_C4,18313_C5,18313_C6,18314_D11,18314_D2,18315_E2,18316_F10,18316_F9,18317_G1,18317_G3,18317_G5,18317_G8,18317_G9,19915_B12,19915_B3,19915_B4,19915_B7,19916_C11,19916_C3,19916_C4,19916_C6,19916_C7,19917_D2,19917_D4,19917_D5,20027_B1,20033_A4,20033_A6,20034_B9,20038_F9,20039_A11,20039_A12,20039_A2,20039_A3,20039_A6,20039_A7,20040_B10,20040_B3,20040_B5,20040_B7,20040_B8,20041_C10,20041_C11,20041_C12,20041_C4,20041_C5,20041_C6,20041_C7,20041_C9,20042_D1,20042_D3,20042_D6,20042_D7,20044_A1,20044_A11,20044_A2,20044_A3,20044_A4,20044_A6,20044_A9,20045_B1,20045_B10,20045_B11,20045_B12,20045_B2,20045_B4,20045_B9,20046_C1,20046_C10,20046_C11,20046_C12,20046_C2,20046_C3,20046_C6,20046_C9,20047_D1,20047_D10,20047_D12,20047_D2,20047_D3,20047_D4,20047_D9,20048_E1,20048_E2,20048_E3,20048_E4,20048_E6,20048_E9,20049_F1,20049_F2,20049_F4,20049_F5,20049_F7,20049_F818251_A4,18251_A8,18252_B2,18252_B4,18252_B5,18252_B9,18253_C10,18253_C12,18253_C3,18253_C5,18253_C6,18253_C7,18253_C9,18254_D1,18254_D11,18254_D4,18254_D7,18254_D8,18255_E1,18255_E6,18256_F4,18256_F5,18256_F6,18256_F9,18257_G2,18257_G5,18257_G8,18267_E5,18270_A9,18271_B1,18271_B12,18273_D12,18273_D3,18273_D9,18274_E8,18275_F4,18276_G4,18311_A1,18311_A12,18311_A2,18311_A8,18312_B1,18312_B5,18312_B9,18313_C3,18313_C4,18313_C5,18313_C6,18314_D11,18314_D2,18315_E2,18316_F10,18316_F9,18317_G1,18317_G3,18317_G5,18317_G8,18317_G9,19915_B12,19915_B3,19915_B4,19915_B7,19916_C11,19916_C3,19916_C4,19916_C6,19916_C7,19917_D2,19917_D4,19917_D5,20027_B1,20033_A4,20033_A6,20034_B9,20038_F9,20039_A11,20039_A12,20039_A2,20039_A3,20039_A6,20039_A7,20040_B10,20040_B3,20040_B5,20040_B7,20040_B8,20041_C10,20041_C11,20041_C12,20041_C4,20041_C5,20041_C6,20041_C7,20041_C9,20042_D1,20042_D3,20042_D6,20042_D7,20044_A1,20044_A11,20044_A2,20044_A3,20044_A4,20044_A6,20044_A9,20045_B1,20045_B10,20045_B11,20045_B12,20045_B2,20045_B4,20045_B9,20046_C1,20046_C10,20046_C11,20046_C12,20046_C2,20046_C3,20046_C6,20046_C9,20047_D1,20047_D10,20047_D12,20047_D2,20047_D3,20047_D4,20047_D9,20048_E1,20048_E2,20048_E3,20048_E4,20048_E6,20048_E9,20049_F1,20049_F2,20049_F4,20049_F5,20049_F7,20049_F8".split(',')
  random.shuffle(cells)
  return(','.join(sorted(cells[:30])))

#+END_SRC

#+RESULTS: subset perichondrium
: 18252_B4,18253_C5,18253_C7,18253_C7,18254_D11,18254_D4,18256_F4,18257_G5,18273_D9,18311_A2,18312_B1,18313_C3,18315_E2,18316_F9,18317_G5,19917_D2,20027_B1,20039_A11,20041_C6,20041_C6,20041_C9,20041_C9,20044_A3,20044_A6,20045_B11,20045_B2,20045_B4,20048_E3,20049_F2,20049_F5

#+begin_src python
  from woldrnaseq.models import load_experiments

  exp = load_experiments(['paper_analysis_vdir/experiment_cluster_subsampled.tsv'])
  return exp['replicates'].apply(lambda x: len(x))

#+end_src

#+RESULTS:
#+begin_example
experiment
EMP               5
chondrocyte      57
ectoderm          8
endothelial       7
macrophage       10
mesenchyme       30
muscle1          54
0,255,0           1
muscle2          38
muscle3          23
neural_crest      8
perichondrium    30
Name: replicates, dtype: int64
#+end_example

#+begin_src bash
pushd paper_analysis_vdir
TARGET=subsample_by_cluster
if [ \! -e ${TARGET} ]; then
  mkdir ${TARGET}
fi
PYTHONPATH=/woldlab/loxcyc/home/diane/proj/trackhub \
python3 -m woldrnaseq.make_trackhub \
  --hub subsample_by_cluster \
  --short-name subsample_by_cluster \
  --long-name "paper subsample" \
  --email diane@caltech.edu \
  --bigwig \
  -o ${TARGET} \
  -w http://woldlab.caltech.edu/~diane/C1_mouse_limb_timecourse/ \
  -l library_vdir.tsv \
  -e experiment_cluster_subsampled.tsv

#+end_src

#+RESULTS:
| ~/proj/C1_mouse_limb_combined/paper_analysis_vdir | ~/proj/C1_mouse_limb_combined                                                           |       |            |         |       |            |           |            |         |         |             |
| sending                                           | incremental                                                                             |  file | list       |         |       |            |           |            |         |         |             |
| subsample_by_cluster.genomes.txt                  |                                                                                         |       |            |         |       |            |           |            |         |         |             |
|                                                   | 38                                                                                      |  100% | 0.00kB/s   | 0:00:00 |       |         38 |      100% | 0.00kB/s   | 0:00:00 | (xfr#1, | to-chk=3/5) |
| subsample_by_cluster.hub.txt                      |                                                                                         |       |            |         |       |            |           |            |         |         |             |
|                                                   | 134                                                                                     |  100% | 130.86kB/s | 0:00:00 |       |        134 |      100% | 130.86kB/s | 0:00:00 | (xfr#2, | to-chk=2/5) |
| mm10/trackDb.txt                                  |                                                                                         |       |            |         |       |            |           |            |         |         |             |
|                                                   | 32,768                                                                                  |   14% | 31.25MB/s  | 0:00:00 |       |    230,129 |      100% | 43.89MB/s  | 0:00:00 | (xfr#3, | to-chk=0/5) |
| sent                                              | 230,652                                                                                 | bytes | received   |      82 | bytes | 461,468.00 | bytes/sec |            |         |         |             |
| total                                             | size                                                                                    |    is | 230,301    | speedup | is    |        1.0 |           |            |         |         |             |
| trackhub:                                         | http://woldlab.caltech.edu/~diane/C1_mouse_limb_timecourse/subsample_by_cluster.hub.txt |       |            |         |       |            |           |            |         |         |             |

hubCheck
http://woldlab.caltech.edu/~diane/C1_mouse_limb_timecourse/subsample_by_cluster/subsample_by_cluster.hub.txt

http://genome.ucsc.edu/cgi-bin/hgTracks?db=mm10&hubUrl=http://woldlab.caltech.edu/~diane/C1_mouse_limb_timecourse/subsample_by_cluster/subsample_by_cluster.hub.txt
* Create tree of spike in types for use by libreoffice

I was able to get libreoffice to pull the spikein alias
from a file using a formula like the following

#+begin_src basic
=FILTERXML(WEBSERVICE(CONCAT("https://woldlab.caltech.edu/~diane/C1_mouse_limb_combined/spikeins_used/",C2,".xml")),"/spike")
#+end_src

I just need to fill a directory with xml files listing the spikein type

#+begin_src python :results output
  import os
  from woldrnaseq.models import load_experiments

  filename = 'all_analysis_vdir/experiment_vdir.tsv'
  experiments = load_experiments([filename])

  target_dir = 'spikeins_used'
  for experiment_id, row in experiments.iterrows():
      print(experiment_id)
      if 'run1' in experiment_id:
          spikein = 'ENCSR013YHQ'
      elif 'run2' in experiment_id:
          spikein = 'ENCSR156CIL'
      else:
          spikein = 'ENCSR535LMC'

      for library_id in row.replicates:
          #library_id = library_id.replace('_mm10', '')
          library_file = os.path.join(target_dir, library_id + '.xml')
          with open(library_file, 'wt') as outstream:
              outstream.write('<spike>{}</spike>'.format(spikein))
              outstream.write(os.linesep)
#+end_src

#+RESULTS:
#+begin_example
C1_e10.5_mouse_limb_run1_June6_2016
C1_e10.5_mouse_limb_run2_June20_2016
C1_e10.5_mouse_limb_run3_Dec5_2016
C1_mouse_e13.5_limb_mesenchyme_mm10_run4
C1_mouse_e11.0_limb_mesenchyme_mm10_run5
C1_mouse_e11.5_limb_mesenchyme_mm10_run6
C1_mouse_e12.5_limb_mesenchyme_mm10_run7
C1_mouse_e13.5_limb_mesenchyme_mm10_run8
C1_mouse_e14.0_forelimb_run13_December14_2017
C1_mouse_e12.5_forelimb_run9_March8_2017_rearray_March152018
C1_mouse_e11.5_forelimb_run10_December11_2017
C1_mouse_e10.5_forelimb_run15_January13AM_2018
C1_mouse_e11.0_forelimb_run16_January13PM_2018
C1_mouse_e14.5_forelimb_run17_January16_2018
C1_mouse_e12.0_forelimb_run11_December12_2017
C1_mouse_e12.0_forelimb_run11_December12_2017
C1_mouse_e13.0_forelimb_run12_December13_2017
C1_mouse_e15.5_forelimb_run14_December15_2017
#+end_example
* Normalizing the different 10x clusters

Q1 Size of files (_sorted.bam):
#+NAME: mapped_reads_for_10x_clusters
| cluster                     | size(G) |    mapped |     total | duplicate |
| c0_mesprox                  |      81 | 863016334 | 908892508 | 252876057 |
| c7_mus1                     |     8.4 |  87266647 |  91832404 |  25663499 |
| c4_mus2                     |      25 | 256539125 | 268600686 |  93777249 |
| c17_mus3                    |      12 | 121354108 | 126470685 |  45028654 |
| c12_mus4                    |     3.7 |  38324828 |  40077905 |  14631266 |
| c0_mesprox_cb_ub_chr_start  |      68 | 690327277 | 725140948 | 155367702 |
| c7_mus1_cb_ub_chr_start     |     7.1 |  70487204 |  73964868 |  16044556 |
| c4_mus2_cb_ub_chr_start     |      20 | 198978700 | 207482320 |  61780633 |
| c17_mus3_cb_ub_chr_start    |     9.4 |  95654707 |  99419684 |  30433965 |
| c12_mus4_cb_ub_chr_start    |     3.0 |  28995068 |  30281331 |   9214097 |
| c0_mesprox fraction removed |    0.16 |      0.20 |      0.20 |      0.39 |
| c7_mus1 fraction removed    |    0.15 |      0.19 |      0.19 |      0.37 |
| c4_mus2 fraction removed    |    0.20 |      0.22 |      0.23 |      0.34 |
| c17_mus3 fraction removed   |    0.22 |      0.21 |      0.21 |      0.32 |
| c12_mus4 fraction removed   |    0.19 |      0.24 |      0.24 |      0.37 |
#+TBLFM: $2=(@-10-@-5)/@-10;%.2f::$3=(@-10-@-5)/@-10;%.2f::$4=(@-10-@-5)/@-10;%.2f::$5=(@-10-@-5)/@-10;%.2f


Q2 number of barcodes:
| cluster    | color | barcode count | run count |
| c0_mesprox | black |         22925 |         9 |
| c7_mus1    | green |          1875 |         8 |
| c4_mus2    | pink  |          3625 |         8 |
| c17_mus3   | red   |          1764 |         8 |
| c12_mus4   | brown |           404 |         7 |

Q3 number of genes called by file.

Q4 How many reads does

After discussing with barbara a likely issue is the tracks 10x cluster
tracks I built are not normalized by the UMIs.


